In [ ]:
# **Pandas Lecture Scrapnote Part 6: Operations and Data Input/Output**

In [ ]:
## **1. Operations**

In [44]:
import numpy as np
import pandas as pd

In [45]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [46]:
### Finding unique value in dataframe

In [47]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [48]:
df['col2'].nunique() # similar with len() function

3

In [49]:
### Value Count

In [50]:
df['col2'].count()

4

In [51]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [ ]:
### Selecting Data (quick reminder)

In [ ]:
df[df['col1']>2]

In [ ]:
### **Apply Method**

# One of the most powerful tools when using pandas.
# .apply(func)

In [ ]:
def times2(x):
    return x*2

In [ ]:
df['col1'].sum()

In [ ]:
##### using user-defined function

In [ ]:
df['col1'].apply(times2)

In [ ]:
df['col2'].apply(times2)

In [ ]:
##### using len function

In [ ]:
df['col3'].apply(len)

In [ ]:
##### using lambda

In [ ]:
df['col2'].apply(lambda x: x**2)

In [ ]:
### Removing Columns (quick review)

In [ ]:
df.drop('col1',axis=1)

In [ ]:
### Return Name of Column & Index Names (quick review)

In [ ]:
df.columns

In [ ]:
df.index

In [ ]:
### Sorting and Ordering a Dataframe (quick review)

In [ ]:
df.sort_values(by='col2')

In [ ]:
### Finding null values (boolean)

In [ ]:
df.isnull()

to then we can, for example, use dropna() function if necessary

In [ ]:
df.dropna() # won't drop anything since we don't have any missing data

In [ ]:
### **Pivot Table**

# pivot_table(values,index,columns)
# values = data point to be made up of
# index = desired index (list)
# column = desired data to be a column name

In [ ]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [ ]:
df

In [ ]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

## **2. Data Input and Output**

Four main/common data sources (at least in Python). They are:
- CSV
- Excel
- HTML (from web)
- SQL

Common Libraries:
- sqlalchemy
- lxml
- html5lib
- beautifulsoup4

In [1]:
import pandas as pd

In [2]:
### CSV File

In [3]:
pd.read_csv('sample/example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df = pd.read_csv('sample/example')

In [5]:
df.to_csv('My_output.csv',index=False) # make sure to put index=false, otherwise the default index will be saved under unnamed object

In [6]:
pd.read_csv('My_output.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [23]:
### Excel File

# Note: Jose's package version is different with mine, so there is a slightly different argument being implemented.
# Also make sure the following libraries are installed:
# - xlrd (to read excel)
# - openpyxl (to write in excel file)

In [24]:
df = pd.read_excel('sample/Excel_Sample.xlsx',sheet_name='Sheet1',index_col=0) # put index_col=0 to remove unnamed:0 column

In [25]:
df.to_excel('Excel_sample2.xlsx',sheet_name='NewSheet')

In [26]:
### **HTML File**

# Sample HTML link: FDIC (http://www.fdic.gov/bank/individual/failed/banklist.html)

In [27]:
# Read table off of the webpage and return the list of DataFrame objects

data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [29]:
type(data)

list

In [30]:
list(data)

[                             Bank Name               City  ST   CERT  \
 0                    Almena State Bank             Almena  KS  15426
 1           First City Bank of Florida  Fort Walton Beach  FL  16748
 2                 The First State Bank      Barboursville  WV  14361
 3                   Ericson State Bank            Ericson  NE  18265
 4     City National Bank of New Jersey             Newark  NJ  21111
 ..                                 ...                ...  ..    ...
 558                 Superior Bank, FSB           Hinsdale  IL  32646
 559                Malta National Bank              Malta  OH   6629
 560    First Alliance Bank & Trust Co.         Manchester  NH  34264
 561  National State Bank of Metropolis         Metropolis  IL   3815
 562                   Bank of Honolulu           Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                            Equity Bank   October 23, 2020
 1              United Fidelity Bank, fsb   October 16, 2020
 2                         MVB Bank, Inc.      April 3, 2020
 3             Farmers and Merchants Bank  February 14, 2020
 4                        Industrial Bank   November 1, 2019
 ..                                   ...                ...
 558                Superior Federal, FSB      July 27, 2001
 559                    North Valley Bank        May 3, 2001
 560  Southern New Hampshire Bank & Trust   February 2, 2001
 561              Banterra Bank of Marion  December 14, 2000
 562                   Bank of the Orient   October 13, 2000

 [563 rows x 6 columns]]

In [33]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [34]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"

In [35]:
### Read SQL Database

# keep in mind: pandas isn't probably the best tool to read SQL database, because there are many flavor of SQl engine.
# search for a specific driver depending on the specific SQL engine that you use.

In [36]:
from sqlalchemy import create_engine

In [38]:
# create a temporary, very small SQLite engine database written in the memory
engine = create_engine('sqlite:///:memory:')

In [40]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [41]:
df.to_sql('my_table_sql',engine) # this engine acts as a connection (usually). Read documentation for more detail

In [42]:
sqldf = pd.read_sql('my_table_sql',con=engine) # specify the actual connection you want in 'con'

In [43]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15